Revit 2024 API
StructuralWallUsageFilter Constructor (StructuralWallUsage, Boolean)
 Constructs a new instance of a filter to match walls that have the given structural wall usage, with the option to match all walls which are not of the given structural wall usage.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public StructuralWallUsageFilter(
	StructuralWallUsage structuralWallUsage,
	bool inverted
)
Visual Basic
Public Sub New ( _
	structuralWallUsage As StructuralWallUsage, _
	inverted As Boolean _
)
Visual C++
public:
StructuralWallUsageFilter(
	StructuralWallUsage structuralWallUsage,
	bool inverted
)
Parameters
structuralWallUsage
Type: Autodesk.Revit.DB.Structure.StructuralWallUsage
 The structural usage to match.
inverted
Type: System.Boolean
 True if the filter should match all walls which are not of the given structural wall usage.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
StructuralWallUsageFilter Class
StructuralWallUsageFilter Overload
Autodesk.Revit.DB.Structure Namespace